weather/NDFDgen.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" > 
<SOAP-ENV:Body>
<ns3591:NDFDgen xmlns:ns3591="uri:DWMLgen">
<latitude xsi:type="xsd:string">latitudeplaceholder</latitude>
<longitude xsi:type="xsd:string">longitudeplaceholder</longitude>
<product xsi:type="xsd:string">time-series</product>
<startTime xsi:type="xsd:string">2004-01-01T00:00:00</startTime>
<endTime xsi:type="xsd:string">2018-02-12T00:00:00</endTime>
<Unit xsi:type="xsd:string">e</Unit>
<weatherParameters>
<maxt xsi:type="xsd:boolean">1</maxt>
<mint xsi:type="xsd:boolean">1</mint>
<appt xsi:type="xsd:boolean">1</appt>
<dew xsi:type="xsd:boolean">1</dew>
</weatherParameters>
</ns3591:NDFDgen>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>